//
//  ContentManager.swift
//  Exam21Lesson
//
//  Created by user on 11.10.2024.
//

import UIKit


final class ContentManager {
    
    func getContent() -> [Model] {
         [
            Model(imageName: "Бараш", description: "Бараш родился 29 апреля — это барашек, поэт-лирик, он вздыхает и пишет стихи о печали, меланхолик. Его тонкую натуру легко обидеть, поэтому Бараш требует много внимания от окружающих, которое он привлекает своей несчастностью и непонятливостью."),
            Model(imageName: "Ежик", description: "Родился 14 февраля — серьёзный и совестливый друг Кроша, флегматик. В отличие от своего приятеля, Ёжик очень хорошо воспитан, рассудителен, и потому не сопротивляется активности и напористости друга. Он понимает, когда Крош не прав, и помогает ему в общении с другими."),
            Model(imageName: "Крош", description: "Родился 29 декабря — Крош - это весёлый и энергичный кролик-непоседа, по темпераменту холерик. Он суетлив и часто перебивает собеседника, часто моргает сначала правым глазом, потом левым, любит приключения вроде похода в горы или подводного плавания и всё время втягивает Ёжика в свои авантюры."),
            Model(imageName: "Нюша", description: "Родилась 13 июля — девочка-хрюшка (свиНюша), которая мечтает стать принцессой, по характеру она сангвиник. Нюша считает себя неотразимой красавицей, следит за своей внешностью и модничает. Она очень любопытна, по-женски манипулирует окружающими и старается быть центром всеобщего внимания. Часто хрюкает."),
            Model(imageName: "Лосяш", description: "Родился 25 мая — это рассеянный и забывчивый лось-учёный, интересуется астрономией и другими науками, даже получил Нобелевскую премию. Из-за чрезмерной увлечённости Лосяша в его доме всегда совершенный беспорядок, да и внешний вид его самого довольно неряшливый. Он очень серьёзен, любит читать книжки и иногда пытается применять свои теории на практике, то есть «ходить в народ». При всей его отрешённости он любит поесть."),
            Model(imageName: "Совунья", description: "Родилась 15 сентября — сова-врач, раньше была преподавателем физкультуры, обожает спорт, любит свежий воздух. Очень хозяйственна, весьма прагматична, обладает большим жизненным опытом, но при этом довольно сентиментальна. Несмотря на своё имя, по режиму дня является жаворонком. Живёт в дупле дерева на северо-западе. ")
        ]
    }
}
