//
//  TextManager.swift
//  Exam21Lesson
//
//  Created by user on 05.11.2024.
//

import UIKit

struct Text {
    let text: String
}

protocol TextManageable {
    func getTextContent() -> Text
}


final class TextManager: TextManageable {
   
    
    func getTextContent() -> Text {
        Text(text: "По-настоящему интересный, познавательный, уже ставший родным, анимационный сериал о круглых животных (и не только), покорил сердца всех зрителей от мала до велика. Стоит отметить, что в мультфильме полностью отсутствуют негативные персонажи. Смешарики вызывают приятную гордость за русских аниматоров — адаптированные версии мультфильма уже успешно транслируются в Америке, Германии, Италии и Великобритании. Сериал был удостоен Государственной премии РФ и одержал победу не в одном престижном конкурсе.По-настоящему интересный, познавательный, уже ставший родным, анимационный сериал о круглых животных (и не только), покорил сердца всех зрителей от мала до велика. Стоит отметить, что в мультфильме полностью отсутствуют негативные персонажи. Смешарики вызывают приятную гордость за русских аниматоров — адаптированные версии мультфильма уже успешно транслируются в Америке, Германии, Италии и Великобритании. Сериал был удостоен Государственной премии РФ и одержал победу не в одном престижном конкурсе.По-настоящему интересный, познавательный, уже ставший родным, анимационный сериал о круглых животных (и не только), покорил сердца всех зрителей от мала до велика. Стоит отметить, что в мультфильме полностью отсутствуют негативные персонажи. Смешарики вызывают приятную гордость за русских аниматоров — адаптированные версии мультфильма уже успешно транслируются в Америке, Германии, Италии и Великобритании. Сериал был удостоен Государственной премии РФ и одержал победу не в одном престижном конкурсе.По-настоящему интересный, познавательный, уже ставший родным, анимационный сериал о круглых животных (и не только), покорил сердца всех зрителей от мала до велика. Стоит отметить, что в мультфильме полностью отсутствуют негативные персонажи. Смешарики вызывают приятную гордость за русских аниматоров — адаптированные версии мультфильма уже успешно транслируются в Америке, Германии, Италии и Великобритании. Сериал был удостоен Государственной премии РФ и одержал победу не в одном престижном конкурсе.")
    }
}
